
import { t } from 'i18next';
import React, { Component } from 'react'
import { SafeAreaView, StatusBar, View, Text, StyleSheet, Animated, Image, ImageBackground, Dimensions, Pressable, ScrollView, TouchableWithoutFeedback, TextInput, OpenURLButton, Linking } from 'react-native';
import colors from '../../constants/colors';
import ComponentsStyle from '../../constants/components';


const Pdpa_th = () => {
    return (
        <>
            <View style={styles.container}>
                <Text style={styles.headText}>{t('consent')}</Text>
                <View style={{ paddingHorizontal: 16, marginTop: 24 }}>
                    <ScrollView showsVerticalScrollIndicator={false}>
                        <Text style={styles.head}>
                            นโยบายความเป็นส่วนตัว (Privacy Policy)
                        </Text>
                        <Text style={[styles.text, { marginTop: 16 }]}>
                            {"  "}นโยบายความเป็นส่วนตัวนี้ จัดทำขึ้นโดย บริษัท บีบีพีเอฟ จำกัด และบริษัทในเครืออื่น ๆ ของ บริษัท บีบีพีเอฟ จำกัด (“บริษัท”)
                            บริษัทขอแจ้งให้ทราบว่า บริษัทมีความจำเป็นต้องเก็บ รวบรวม ใช้ และเปิดเผย (“ประมวลผล”) ข้อมูลส่วนบุคคลของท่านที่มาใช้บริการของบริษัท ทั้งทางเว็บไซต์ แอพพลิเคชั่น โซเชียลมีเดีย ช่องทางอื่น และผู้มาติดต่อกับบริษัท ภายใต้นโยบายข้อมูลส่วนบุคคลฉบับนี้ บริษัทส่งต่อเปิดเผยข้อมูลส่วนบุคคลของท่าน ให้แก่บริษัทเพื่อประโยชน์ในการติดต่อ ประสานงาน และ/หรือการให้บริการจากบริษัทให้แก่ท่าน บริษัทจะถือว่าท่านตกลงและยอมรับที่จะปฏิบัติตามนโยบายข้อมูลส่วนบุคคลฉบับนี้แล้ว
                        </Text>
                        <Text style={[styles.head, { marginTop: 16 }]}>
                            ข้อมูลส่วนบุคคลที่บริษัทประมวลผล
                        </Text>
                        <Text style={[styles.text, { marginTop: 16 }]}>
                            บริษัทอาจได้รับข้อมูลส่วนบุคคลของท่าน ได้จากหลายช่องทาง ดังนี้
                        </Text>
                        <Text style={[styles.text, { marginTop: 16 }]}>
                            {"  "}1.ได้รับโดยตรง จากการติดต่อสื่อสารระหว่างบริษัทและท่าน
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}2.ได้รับทางอ้อมจากการอ้างอิงจากบุคคลอื่น ซึ่งท่านอาจให้ความยินยอมให้บุคคลดังกล่าวเปิดเผยส่งต่อข้อมูลส่วนบุคคลของท่านให้แก่ บริษัท หรือ
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}3.เก็บรวบรวมโดยอัตโนมัติด้วยระบบ เมื่อท่านเข้าใช้บริการผ่านระบบของบริษัทฯ หรือเข้าชมเว็บไซต์ของบริษัทฯ ผ่านอุปกรณ์อิเล็กทรอนิกส์ เช่น โทรศัพท์เคลื่อนที่ คอมพิวเตอร์ แล็ปท็อป เป็นต้น ด้วยเทคโนโลยีที่เรียกว่า “คุกกี้” หรือ เทคโนโลยีอื่นที่มีลักษณะการทำงานเหมือนหรือคล้ายกัน
                        </Text>

                        <Text style={[styles.head, { marginTop: 16 }]}>
                            ข้อมูลส่วนบุคคลที่บริษัทมีความจำเป็นต้องเก็บ รวบรวม ใช้ และประมวลผลภายใต้นโยบายข้อมูลส่วนบุคคล ฉบับนี้ ได้แก่
                        </Text>
                        <Text style={[styles.text, { marginTop: 16 }]}>
                            {"  "}1. ชื่อนามสกุล รวมถึงข้อมูลที่เกี่ยวเนื่องของท่าน หรือของตัวแทนของท่าน (ในกรณีที่ท่านติดต่อมาในนามของนิติบุคคล) ซึ่งอาจรวมถึงข้อมูลเอกสารการแสดงตนของท่าน
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}2.ข้อมูลการติดต่อ อาทิ เบอร์โทรศัพท์ อีเมล หรือข้อมูล Social Media Account
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}3.ข้อมูลส่วนบุคคลอื่น ๆ ที่ท่านอาจให้แก่บริษัทระหว่างการติดต่อสื่อสาร เช่น ข้อมูลเรื่องที่ต้องการติดต่อสอบถาม ข้อมูลความสนใจ หรือข้อมูลประกอบอื่น ๆ ที่อาจระบุตัวตนของท่านได้ซึ่งท่านให้แก่ บริษัท โดยตรงผ่านช่องทางการติดต่อสื่อสารต่าง ๆ
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}4.  กรณีการติดต่อผ่าน Website อาจรวมถึงข้อมูลทางเทคนิคของท่าน ได้แก่ IP Address, Cookies รวมถึงข้อมูลพฤติกรรมการสืบค้นของท่าน
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}5.ข้อมูลส่วนบุคคลอ่อนไหว หมายถึง ข้อมูลส่วนบุคคลเกี่ยวกับเชื้อชาติ เผ่าพันธุ์ ความคิดเห็นทางการเมืองความเชื่อในลัทธิ ศาสนาหรือปรัชญา พฤติกรรมทางเพศ ประวัติอาชญากรรม ข้อมูลสุขภาพ ความพิการ ข้อมูลสหภาพแรงงาน ข้อมูลพันธุกรรม ข้อมูลชีวภาพ หรือข้อมูลอื่นใดซึ่งกระทบต่อเจ้าของข้อมูลส่วนบุคคลในทำนองเดียวกันตามที่คณะกรรมการคุ้มครองข้อมูลส่วนบุคคลประกาศกำหนด

                        </Text>
                        <Text style={[styles.head, { marginTop: 16 }]}>
                            บริษัทจำเป็นต้องเก็บ รวบรวม และใช้ข้อมูลส่วนบุคคลของท่านตามที่ระบุไว้ภายใต้นโยบายข้อมูลส่วนบุคคลฉบับนี้ เพื่อวัตถุประสงค์ต่าง ๆ  ดังต่อไปนี้
                        </Text>
                        <Text style={[styles.text, { marginTop: 16 }]}>
                            {"  "}1.เพื่อวัตถุประสงค์การให้บริการ อาจจะรวมถึงการลงทะเบียนและรักษาบัญชีทั้งแบบออนไลน์และออฟไลน์, การออกแบบโปรแกรมส่วนบุคคลตามข้อมูลที่ท่านได้กรอกข้อมูลเข้ามา, และติดตามกิจกรรมการออกกำลังของท่าน บริษัทจำเป็นต้องเก็บข้อมูลของท่านเพื่อให้ท่านสามารถทบทวนและติดตามความก้าวหน้าของท่านเอง
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}2.สำหรับการประมวลผลข้อมูลด้วยวัตถุประสงค์การให้บริการ การจัดทำสัญญา และ/หรือการปฏิบัติสิทธิและหน้าที่ภายใต้สัญญา บริษัทจำเป็นต้องประมวลผลข้อมูลส่วนบุคคลของท่าน ตราบเท่าที่บริษัทยังมีหน้าที่ให้บริการแก่ท่าน
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}3.เพื่อการจัดการตอบรับการสื่อสารที่ท่านเข้ามาใช้บริการมายังบริษัท เช่น เพื่อการตอบคำถาม การส่งข้อมูลที่เกี่ยวข้องตามที่ท่านร้องขอและต้องการ การจัดการข้อร้องเรียน หรือการตอบรับความคิดเห็นต่าง ๆ ที่ท่านให้แก่บริษัทโดยตรง ผ่านช่องทางการติดต่อสื่อสารต่าง ๆ รวมถึงการประสานงานต่อเนื่องไปจนถึงการให้บริการ การจัดทำสัญญาการให้บริการ และ/หรือการปฏิบัติสิทธิและหน้าที่ที่บริษัทและท่านอาจตกลงและจัดทำระหว่างกันต่อเนื่อง
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}4.เพื่อการปฏิบัติหน้าที่ตามกฎหมายที่บริษัทอาจอยู่ภายใต้เงื่อนไขทีต้องปฏิบัติตาม ซึ่งอาจรวมถึงแต่ไม่จำกัดเพียง การปฏิบัติหน้าที่ในการจัดทำเอกสารบัญชี และภาษีสำหรับการให้บริการใด ๆ ที่บริษัทอาจให้ แก่ท่าน
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}5. เพื่อการสร้างและปรับปรุงความสัมพันธ์ทางธุรกิจ รวมถึงการปรับปรุงการให้บริการที่บริษัทจะดำเนินการเพื่อประโยชน์ของท่านให้ดีขึ้น ซึ่งบริษัทอาจรวบรวม ใช้ข้อมูลส่วนบุคคลของท่าน เพื่อประ โยชน์ในการควบคุม การรับประกันคุณภาพ การวิเคราะห์การบริหารจัดการและแก้ไขปัญหาต่าง ๆ ที่เกี่ยวข้องของบริษัท รวมถึงแต่ไม่จำกัดเพียงการฝึกอบรมพนักงาน หรือการวางแผนการให้ปรับปรุงการให้บริการในอนาคต
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}6. เพื่อประโยชน์ในการปกป้องและต่อสู้สิทธิอันชอบด้วยกฎหมายของบริษัท ในกรณีที่อาจเกิดข้อพิพาท ระหว่างท่านและบริษัท ไม่ว่าในลักษณะใด
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}7.กรณีที่บริษัทอาจได้รับความยินยอม ในการประมวลผลข้อมูลส่วนบุคคลด้วยจุดประสงค์เฉพาะเจาะจงจากท่าน เช่น เพื่อการติดต่อประชาสัมพันธ์ทางการตลาด และการประชาสัมพันธ์ข่าวสารต่าง ๆ บริษัทจะประมวลผลข้อมูลตามวัตถุประสงค์ดังกล่าว
                        </Text>
                        <Text style={[styles.head, { marginTop: 16 }]}>
                            ระยะเวลาในการประมวลผลข้อมูลส่วนบุคคล
                        </Text>
                        <Text style={[styles.text, { marginTop: 16 }]}>
                            เพื่อดำเนินการตามวัตถุประสงค์ที่ระบุไว้ข้างต้นทั้งหมด บริษัทจำเป็นต้องเก็บรวบรวมและประมวลผลข้อมูลส่วนบุคคลของท่านเป็นระยะเวลา ดังนี้
                        </Text>
                        <Text style={[styles.text, { marginTop: 16 }]}>
                            {"  "}1.สำหรับการประมวลผลข้อมูลด้วยวัตถุประสงค์การให้บริการ การจัดทำสัญญา และ/หรือการปฏิบัติสิทธิและหน้าที่ภายใต้สัญญา บริษัทจำเป็นต้องประมวลผลข้อมูลส่วนบุคคลของท่าน ตราบเท่าที่บริษัทยังมีหน้าที่ให้บริการแก่ท่าน
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}2.สำหรับการประมวลผลข้อมูล ด้วยวัตถุประสงค์การปฏิบัติหน้าที่ตามกฎหมายของบริษัท บริษัทจำเป็นต้องประมวลผลข้อมูลส่วนบุคคลของท่าน ไว้ตามระยะเวลาที่กฎหมายที่เกี่ยวข้องกำหนดไว้
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}3.สำหรับการประมวลผลข้อมูลส่วนบุคคลเพื่อการสร้างและปรับปรุงความสัมพันธ์ทางธุรกิจ และ/หรือการปรับปรุงการให้บริการ บริษัทสงวนสิทธิ์ในการเก็บรักษาข้อมูลส่วนบุคคลนั้นเท่าที่บริษัทอาจ มีความจำเป็นทางธุรกิจ โดยรับประกันไม่ให้กระทบสิทธิของท่านในฐานะเจ้าของข้อมูลเกินสมควร
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}4.สำหรับการประมวลผลข้อมูลส่วนบุคคล เพื่อการปกป้องและต่อสู้สิทธิอันชอบด้วยกฎหมายของบริษัท บริษัทมีความจำเป็นเก็บรักษาข้อมูลส่วนบุคคลดังกล่าว ตลอดอายุความที่เกี่ยวข้อง และ
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}5.กรณีที่ท่านให้ความยินยอมแก่บริษัท ในการประมวลผลข้อมูลด้วยวัตถุประสงค์เฉพาะ บริษัทจะประมวล ผลข้อมูลส่วนบุคคลของท่านจนกว่าท่านจะถอนความยินยอม
                        </Text>
                        <Text style={[styles.head, { marginTop: 16 }]}>
                            การเปิดเผยข้อมูลส่วนบุคคล
                        </Text>
                        <Text style={[styles.text, { marginTop: 16 }]}>
                            โดยหลักการแล้ว ข้อมูลส่วนบุคคลของท่านจะไม่ถูกเปิดเผย ยกเว้นเป็นการเปิดเผยข้อมูลส่วนบุคคลที่บริษัทจำเป็นต้องดำเนินการ ให้แก่ กลุ่มบุคคลดังนี้
                        </Text>
                        <Text style={[styles.text, { marginTop: 16 }]}>
                            {"  "}1.ข้อมูลส่วนบุคคลของท่าน อาจมีการเปิดเผยหรือนำส่งให้กับหน่วยงานต่างๆ ภายในบริษัทฯ เฉพาะที่เกี่ยวข้องและมีบทบาทหน้าที่เท่าที่จำเป็นตามวัตถุประสงค์เท่านั้น โดยบุคคลหรือทีมงานเหล่านี้ของบริษัทฯ จะได้รับอนุญาตให้เข้าถึงข้อมูลส่วนบุคคลของท่าน ตามความจำเป็นและเหมาะสม
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}2.การเปิดเผยข้อมูลส่วนบุคคลของท่านให้แก่ ผู้ให้บริการภายนอกของบริษัทที่ให้การช่วยเหลือสนับสนุนบริษัทในการให้บริการแก่ท่าน รวมถึงที่ปรึกษาด้านการดำเนินธุรกิจของบริษัท โดยบริษัทจะส่งต่อและเปิดเผยข้อมูลส่วนบุคคลของท่านตามขอบเขตของวัตถุประสงค์ที่ระบุไว้ และบนพื้นฐานเท่าที่จำเป็นเท่านั้น หรือ
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}3.กรณีที่บริษัทอาจอยู่ภายใต้บังคับคำสั่งหรือคำพิพากษา ของหน่วยงานราชการ บริษัทอาจมีความจำเป็นในการส่งต่อเปิดเผยข้อมูลส่วนบุคคลของท่านให้แก่หน่วยงานดังกล่าว
                        </Text>
                        <Text style={[styles.head, { marginTop: 16 }]}>
                            บริษัทรับประกันการจัดให้มีมาตรการการรักษาความมั่นคงปลอดภัยที่เหมาะสม
                        </Text>
                        <Text style={[styles.text, { marginTop: 16 }]}>
                            เพื่อป้องกันการเข้าถึง การใช้ การเปลี่ยนแปลง การแก้ไข หรือการเปิดเผยข้อมูลส่วนบุคคลโดยปราศจากอำนาจหรือโดยมิชอบ ทั้งนี้ บริษัทจะจัดให้มีการทบทวนมาตรการดังกล่าวเป็นระยะตามความเหมาะสม และโดยสอดคล้องกับกฎหมายที่เกี่ยว ข้อง
                        </Text>
                        <Text style={[styles.head, { marginTop: 16 }]}>
                            สิทธิของเจ้าของข้อมูล
                        </Text>
                        <Text style={[styles.text, { marginTop: 16 }]}>
                            บริษัทเคารพสิทธิของท่าน ในฐานะเจ้าของข้อมูลภายใต้กฎหมายที่เกี่ยวข้อง โดยท่านสามารถติดต่อบริษัท เพื่อขอใช้สิทธิของท่าน ซึ่งได้แก่
                        </Text>
                        <Text style={[styles.text, { marginTop: 16 }]}>
                            {"  "}1.สิทธิในการถอนความยินยอม
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}2.สิทธิในการขอเข้าถึง
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}3.สิทธิในการขอรับสำเนาข้อมูลส่วนบุคคลของท่าน
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}4.สิทธิในการขอปรับปรุงข้อมูลให้ถูกต้อง
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}5.สิทธิในการขอคัดค้านการประมวลผลข้อมูลส่วนบุคคล
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}6.สิทธิในการขอโอนถ่ายข้อมูลที่เก็บบันทึกในรูปแบบอิเล็กทรอนิกส์ที่สามารถถ่ายโอนได้ง่าย รวมถึงการโอนถ่ายไปให้แก่ผู้ควบคุมข้อมูลส่วนบุคคลอื่น
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}7.สิทธิขอให้ลบหรือทำลายข้อมูลของท่านเมื่อหมดความจำเป็น
                        </Text>
                        <Text style={[styles.text]}>
                            {"  "}8.สิทธิในการขอให้ระงับการประมวลผลข้อมูลส่วนบุคคลชั่วคราว และ สิทธิในการร้องเรียนได้
                        </Text>
                        <Text style={[styles.head, { marginTop: 16 }]}>
                            กฎหมายที่ใช้บังคับ
                        </Text>
                        <Text style={[styles.text, { marginTop: 16 }]}>
                            ท่านรับทราบและตกลงให้ประกาศความเป็นส่วนตัวนี้ อยู่ภายใต้การบังคับตามกฎหมายไทยและศาลไทยเป็นผู้มีอำนาจในการพิจารณาข้อพิพาทใดที่อาจเกิดขึ้น {"\n"}
                            ประกาศใช้ ณ วันที่ xxxxxx
                        </Text>
                        <Text style={[styles.head, { marginTop: 16 }]}>
                            ข้อมูลติดต่อบริษัท
                        </Text>
                        <Text style={[styles.text, { marginTop: 16 }]}>
                            เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล
                        </Text>
                        <Text style={[styles.text, { marginTop: 16 }]}>
                            คุณธนกร นำรับพร
                        </Text>
                        <Text style={[styles.text, { marginTop: 16 }]}>
                            ที่อยู่:429/129 ถนนสรงประภา แขวงดอนเมือง เขตดอนเมือง กรุงเทพฯ 10210
                        </Text>
                        <Text style={[styles.text, { marginTop: 16 }]}>
                            อีเมล: tanakorn@planforfit.com
                        </Text>
                        <Text style={[styles.text, { marginTop: 16, marginBottom: 100 }]}>
                            เบอร์โทรศัพท์ 083-066-4647, 093-883-2339
                        </Text>
                    </ScrollView>
                </View>
            </View>
        </>
    );
};


const deviceWidth = Math.round(Dimensions.get('window').width);
const styles = StyleSheet.create({
    container: {
        flex: 1,
        position: "relative",
        backgroundColor: colors.white
    },
    headText: {
        marginHorizontal: 16,
        color: colors.grey1,
        fontFamily: "IBMPlexSansThai-Bold",
        fontSize: 24,
    },
    head: {

        color: colors.grey1,
        fontFamily: "IBMPlexSansThai-Bold",
        fontSize: 16,
    },
    text: {
        color: colors.grey1,
        fontFamily: "IBMPlexSansThai-Regular",
        fontSize: 16,
    }
});


export default Pdpa_th;